#ifndef GUARD_POKEMON_H
#define GUARD_POKEMON_H

#include "contest_effect.h"
#include "sprite.h"
#include "constants/battle.h"
#include "constants/cries.h"
#include "constants/form_change_types.h"
#include "constants/hold_effects.h"
#include "constants/items.h"
#include "constants/map_groups.h"
#include "constants/regions.h"
#include "constants/region_map_sections.h"
#include "constants/map_groups.h"
#include "constants/battle.h"
#include "constants/abilities.h"
#include "contest_effect.h"
#include "constants/trainers.h"

#define GET_BASE_SPECIES_ID(speciesId) (GetFormSpeciesId(speciesId, 0))
#define FORM_SPECIES_END (0xffff)

#define METHOD_NONE 0
#define METHOD_MASUDA_METHOD 1
#define METHOD_DEXNAV 2
#define METHOD_CHAIN_FISHING 3

// Property labels for Get(Box)MonData / Set(Box)MonData
enum MonData {
    MON_DATA_PERSONALITY,
    MON_DATA_STATUS,
    MON_DATA_OT_ID,
    MON_DATA_LANGUAGE,
    MON_DATA_SANITY_IS_BAD_EGG,
    MON_DATA_SANITY_HAS_SPECIES,
    MON_DATA_SANITY_IS_EGG,
    MON_DATA_OT_NAME,
    MON_DATA_MARKINGS,
    MON_DATA_CHECKSUM,
    MON_DATA_HP,
    MON_DATA_IS_SHINY,
    MON_DATA_HIDDEN_NATURE,
    MON_DATA_HP_LOST,
    MON_DATA_DAYS_SINCE_FORM_CHANGE,
    MON_DATA_ENCRYPT_SEPARATOR,
    MON_DATA_NICKNAME,
    MON_DATA_NICKNAME10,
    MON_DATA_SPECIES,
    MON_DATA_HELD_ITEM,
    MON_DATA_MOVE1,
    MON_DATA_MOVE2,
    MON_DATA_MOVE3,
    MON_DATA_MOVE4,
    MON_DATA_PP1,
    MON_DATA_PP2,
    MON_DATA_PP3,
    MON_DATA_PP4,
    MON_DATA_PP_BONUSES,
    MON_DATA_COOL,
    MON_DATA_BEAUTY,
    MON_DATA_CUTE,
    MON_DATA_EXP,
    MON_DATA_HP_EV,
    MON_DATA_ATK_EV,
    MON_DATA_DEF_EV,
    MON_DATA_SPEED_EV,
    MON_DATA_SPATK_EV,
    MON_DATA_SPDEF_EV,
    MON_DATA_FRIENDSHIP,
    MON_DATA_SMART,
    MON_DATA_POKERUS,
    MON_DATA_MET_LOCATION,
    MON_DATA_MET_LEVEL,
    MON_DATA_MET_GAME,
    MON_DATA_POKEBALL,
    MON_DATA_HP_IV,
    MON_DATA_ATK_IV,
    MON_DATA_DEF_IV,
    MON_DATA_SPEED_IV,
    MON_DATA_SPATK_IV,
    MON_DATA_SPDEF_IV,
    MON_DATA_IS_EGG,
    MON_DATA_ABILITY_NUM,
    MON_DATA_TOUGH,
    MON_DATA_SHEEN,
    MON_DATA_OT_GENDER,
    MON_DATA_COOL_RIBBON,
    MON_DATA_BEAUTY_RIBBON,
    MON_DATA_CUTE_RIBBON,
    MON_DATA_SMART_RIBBON,
    MON_DATA_TOUGH_RIBBON,
    MON_DATA_LEVEL,
    MON_DATA_MAX_HP,
    MON_DATA_ATK,
    MON_DATA_DEF,
    MON_DATA_SPEED,
    MON_DATA_SPATK,
    MON_DATA_SPDEF,
    MON_DATA_MAIL,
    MON_DATA_SPECIES_OR_EGG,
    MON_DATA_IVS,
    MON_DATA_CHAMPION_RIBBON,
    MON_DATA_WINNING_RIBBON,
    MON_DATA_VICTORY_RIBBON,
    MON_DATA_ARTIST_RIBBON,
    MON_DATA_EFFORT_RIBBON,
    MON_DATA_MARINE_RIBBON,
    MON_DATA_LAND_RIBBON,
    MON_DATA_SKY_RIBBON,
    MON_DATA_COUNTRY_RIBBON,
    MON_DATA_NATIONAL_RIBBON,
    MON_DATA_EARTH_RIBBON,
    MON_DATA_WORLD_RIBBON,
    MON_DATA_MODERN_FATEFUL_ENCOUNTER,
    MON_DATA_KNOWN_MOVES,
    MON_DATA_RIBBON_COUNT,
    MON_DATA_RIBBONS,
    MON_DATA_ATK2,
    MON_DATA_DEF2,
    MON_DATA_SPEED2,
    MON_DATA_SPATK2,
    MON_DATA_SPDEF2,
    MON_DATA_HYPER_TRAINED_HP,
    MON_DATA_HYPER_TRAINED_ATK,
    MON_DATA_HYPER_TRAINED_DEF,
    MON_DATA_HYPER_TRAINED_SPEED,
    MON_DATA_HYPER_TRAINED_SPATK,
    MON_DATA_HYPER_TRAINED_SPDEF,
    MON_DATA_IS_SHADOW,
    MON_DATA_DYNAMAX_LEVEL,
    MON_DATA_GIGANTAMAX_FACTOR,
    MON_DATA_TERA_TYPE,
    MON_DATA_EVOLUTION_TRACKER,
	MON_DATA_COOL_CV,
    MON_DATA_BEAUTY_CV,
    MON_DATA_CUTE_CV,
    MON_DATA_SMART_CV,
    MON_DATA_TOUGH_CV,
	MON_DATA_CONTEST_EXP,
	MON_DATA_HIDDEN_POWER,
};

struct BoxPokemon
{
    /*0x00*/ u32 personality;
    /*0x04*/ u32 otId;
    /*0x08*/ u8 nickname[min(10, POKEMON_NAME_LENGTH)];
             u8 metLevel:1;
             u8 isEgg:1;
             u8 markings:4; // 15 combinations as per sAnims_MarkingCombo
    /*0x2A*/ u8 allIV:2;
    /*0x14*/ u8 otName[PLAYER_NAME_LENGTH];
    // /*0x1B*/ u8 metLocation;    // better to not limit the number of map sections. this is actually used for friendship growth, too
    /*0x1C*/u32 species:11;    // up to 2047 species. could probably go down to 10 bits...
            u32 heldItem:10;   // up to 1023 items. could probably be 9 bits if hold items are limited to IDs below 511
			u32 nickname11:8; // 11th character of nickname.
    /*0x20*/u32 experience:21;
			u16 nickname12:8; // 12th character of nickname.
    /*0x24*/ u32 move1:11;  // 2047 moves
             u32 move2:11;  // bits 11-20
             u32 move3:11;  // bits 21-30
    /*0x28*/ u16 move4:11;  // bits 31-40
    /*0x2C*/ u8 ppBonuses;
    /*0x2D*/ u8 friendship;
    /*0x2E*/ u8 pokeball:6;
             u8 abilityNum:2;
    /*0x2F*/ u8 hpEV:4;
    /*0x30*/ u8 attackEV:4;
    /*0x31*/ u8 defenseEV:4;
    /*0x32*/ u8 speedEV:4;
    /*0x33*/ u8 spAttackEV:4;
    /*0x34*/ u8 spDefenseEV:4; 
			 u16 evolutionTracker1:5;
			 u16 evolutionTracker2:5;
			 u16 hiddenNatureModifier:5; // remain 10 bits
			 u16 shinyModifier:1;
			 u16 hpLost:11; // 2048 HP.
			 u16 hiddenPower:5; // remain 10 bits
}; /* size = 0x3C (84) bytes */

struct Pokemon
{
    struct BoxPokemon box;
    u32 status;
    u8 level;
    u8 mail;
    u16 hp;
    u16 maxHP;
    u16 attack;
    u16 defense;
    u16 speed;
    u16 spAttack;
    u16 spDefense;
	u8 pp1:7;
	u8 pp2:7;
	u8 pp3:7;
	u8 pp4:7;
};

struct MonSpritesGfxManager
{
    bool32 active;
    void *spriteBuffer;
    u8 **spritePointers;
    struct SpriteTemplate *templates;
    struct SpriteFrameImage *frameImages;
};

#define UNPACK_VOLATILE_STRUCT(_enum, _fieldName, _typeMaxValue, ...) INVOKE_WITH_(UNPACK_VOLATILE_STRUCT_, _fieldName, UNPACK_B(_typeMaxValue));
#define UNPACK_VOLATILE_STRUCT_(_fieldName, _type, ...) _type FIRST(__VA_OPT__(_fieldName:BIT_SIZE(FIRST(__VA_ARGS__)),) _fieldName)

struct Volatiles
{
    VOLATILE_DEFINITIONS(UNPACK_VOLATILE_STRUCT)
    // Expands to:
    // u32 confusionTurns:3;
    // u32 flinched:1;
    // u32 uproarTurns:3;
    // u32 torment:1;
    // u32 bideTurns:2;
    // u32 lockConfusionTurns:2;
    // u32 multipleTurns:1;
    // u32 wrapped:1;
    // u32 powder:1;
    // u32 padding:1;
    // u32 infatuation:4; // one bit for each battler
    // u32 defenseCurl:1;
    // u32 transformed:1;
    // u32 recharge:1;
    // u32 rage:1;
    // u32 substitute:1;
    // u32 destinyBond:1;
    // u32 escapePrevention:1;
    // u32 nightmare:1;
    // u32 cursed:1;
    // u32 foresight:1;
    // u32 dragonCheer:1;
    // u32 focusEnergy:1;
    // u32 bonusCritStages:3;
};

struct BattlePokemon
{
    /*0x00*/ u16 species;
    /*0x02*/ u16 attack;
    /*0x04*/ u16 defense;
    /*0x06*/ u16 speed;
    /*0x08*/ u16 spAttack;
    /*0x0A*/ u16 spDefense;
    /*0x0C*/ u16 moves[MAX_MON_MOVES];
    /*0x14*/ u32 hpIV:5;
    /*0x14*/ u32 attackIV:5;
    /*0x15*/ u32 defenseIV:5;
    /*0x15*/ u32 speedIV:5;
    /*0x16*/ u32 spAttackIV:5;
    /*0x17*/ u32 spDefenseIV:5;
    /*0x17*/ u32 abilityNum:2;
    /*0x18*/ s8 statStages[NUM_BATTLE_STATS];
    /*0x20*/ enum Ability ability;
    /*0x22*/ enum Type types[3];
    /*0x25*/ u8 pp[MAX_MON_MOVES];
    /*0x29*/ u16 hp;
    /*0x2B*/ u8 level;
    /*0x2C*/ u8 friendship;
    /*0x2D*/ u16 maxHP;
    /*0x2F*/ u16 item;
    /*0x31*/ u8 nickname[POKEMON_NAME_LENGTH + 1];
    /*0x3C*/ u8 ppBonuses;
    /*0x3D*/ u8 otName[PLAYER_NAME_LENGTH + 1];
    /*0x45*/ u32 experience;
    /*0x49*/ u32 personality;
    /*0x4D*/ u32 status1;
    /*0x51*/ struct Volatiles volatiles;
    /*0x5D*/ u32 otId;
    /*0x61*/ u8 metLevel;
    /*0x62*/ bool8 isShiny;
};

struct EvolutionParam
{
    u16 condition;
    u16 arg1;
    u16 arg2;
    u16 arg3;
};

struct Evolution
{
    u16 method;
    u16 param;
    u16 targetSpecies;
    const struct EvolutionParam *params;
};

struct SpeciesInfo /*0xC4*/
{
    u8 baseHP;
    u8 baseAttack;
    u8 baseDefense;
    u8 baseSpeed;
    u8 baseSpAttack;
    u8 baseSpDefense;
    enum Type types[2];
    u8 catchRate;
    u8 forceTeraType;
    u16 expYield; // expYield was changed from u8 to u16 for the new Exp System.
    u16 evYield_HP:2;
    u16 evYield_Attack:2;
    u16 evYield_Defense:2;
    u16 evYield_Speed:2;
    u16 evYield_SpAttack:2;
    u16 evYield_SpDefense:2;
    u16 padding2:4;
    u16 itemCommon;
    u16 itemRare;
    u8 genderRatio;
    u8 eggCycles;
    u8 friendship;
    u8 growthRate;
    u8 eggGroups[2];
    enum Ability abilities[NUM_ABILITY_SLOTS]; // 3 abilities, no longer u8 because we have over 255 abilities now.
    u8 safariZoneFleeRate;

